{
  "bio": "I'm a software developer at VXFiber in Milan. My activities regards the design and development of Web applications based on modern Web technologies. Previously I worked at the Institute of Informatics and Telematics (IIT) of the National Research Council (CNR) of Pisa. I received my Ph.D. in Information Engineering from the University of Pisa presenting a thesis about the visualization of Semantic Web data. My interests are mainly focused on data analysis, visualization and Web technologies.",
  "nodes": [
    {
      "type": "Education",
      "label": "Ph.D. in Information Engineering",
      "short_label": "Ph.D.",
      "location": "University of Pisa",
      "description": "My thesis, titled \"Interactive Visualization of Semantic Web Data\", presents a method, based on the use of cartographic principles and space-filling curves, for visually representing and exploring Linked Data sets as they were traditional geographic maps.",
      "timerange": {
        "start": "October 2013",
        "end": "January 2017"
      },
      "thesis": "PhD_thesis.pdf",
      "imgs": ["dbpedia.png", "linkedmdb.png"]
    },
    {
      "type": "Education",
      "label": "Master Degree in Computer Science",
      "short_label": "Master Degree",
      "location": "University of Trento",
      "description": "My thesis, titled \"Spacetime: A Two Dimensions Search and Visualisation Engine Based on Linked Data\", proposes a tool for searching specific entities coming from DBpedia and visualizing it in a spatio-temporal way.",
      "timerange": {
        "start": "October 2011",
        "end": "July 2013"
      },
      "thesis": "MasterDegree_thesis.pdf"
    },
    {
      "type": "Education",
      "label": "Bachelor Degree in Computer Science",
      "short_label": "Bachelor Degree",
      "location": "University of Milano Bicocca",
      "description": "I worked on a thesis focused on pedestrian dynamics, a research area studying pedestrian behaviours. The thesis describes a comparative development of virtual simulations performed using different software. The specific case of a bridge in the area of Porta Genova in Milan has been developed during the crowdy event of the Salone del Mobile.",
      "timerange": {
        "start": "October 2008",
        "end": "July 2011"
      },
      "thesis": "BachelorDegree_thesis.pdf"
    },
    {
      "type": "Experience",
      "label": "Senior Software Team Leader",
      "short_label": "VXFiber",
      "location": "VXFiber",
      "place": "Milan",
      "description": "Design and development of Web applications based on modern Web technologies for VXFiber, a digital infrastructure specialist, with more than 20 years’ experience building full fibre FTTP (fibre-to-the-premises) Open Access Networks.",
      "technologies": ["React", "Redux", "Redux-Saga", "React Router", "React Hooks", "NPM", "Webpack", "Camunda BPM", "Stripe", "Cordova", "D3", "React Intl", "React Hook Form", "Redux Form", "Material UI", "Semantic React UI", "Sentry", "..."],
      "timerange": {
        "start": "January 2018",
        "end": "Present"
      }
    },
    {
      "type": "Experience",
      "label": "Research Fellow",
      "short_label": "CNR",
      "location": "National Research Council (CNR), Institute of Informatics and Telematics (IIT)",
      "place": "Pisa",
      "description": "The activities I have carried out in the last years at the CNR were primarily focused on the design and development of Web applications. I partecipated in different projects in which data always had a key role. For this reason I developed skills in the management, analysis and visualization of data using different kinds of Web technologies.",
      "timerange": {
        "start": "August 2013",
        "end": "January 2018"
      }
    },
    {
      "type": "Experience",
      "label": "Intern",
      "short_label": "Intern",
      "location": "Complex Systems and Artificial Intelligence (CSAI) Research Center",
      "place": "Milano",
      "description": "I did this internship during the third year of my Bachelor. I worked at the CSAI center and I partecipated to their activities focused on pedestrian dynamics, the topic of my thesis developed during the intership.",
      "timerange": {
        "start": "March 2011",
        "end": "June 2011"
      }
    },
    {
      "type": "Experience",
      "label": "Freelance developer",
      "short_label": "Freelance developer",
      "description": "I developed a Web application for managing the administration activities of a social cooperative (Atipica Cooperativa Sociale onlus).",
      "timerange": {
        "start": "May 2007",
        "end": "March 2008"
      }
    },
    {
      "type": "Experience",
      "label": "Intern",
      "short_label": "Intern",
      "location": "Redix Information SRL",
      "description": "I contributed to the development of a project management software for the Milan Chamber of Commerce.",
      "place": "Lissone (MI)",
      "timerange": {
        "start": "June 2006",
        "end": "July 2006"
      }
    },
    {
      "type": "Project",
      "label": "Visolario",
      "short_label": "Visolario",
      "category": "Research project",
      "description": "It is a research study aimed to first examine the Border Gateway Protocol (BGP) Internet traffic data collected by the Isolario project and then design and develop interactive visualizations for exploring, consulting and getting insights about data.",
      "technologies": ["Coffeescript", "D3.js", "Power graph analysis"],
      "timerange": {
        "start": "November 2017",
        "end": "January 2018"
      },
      "links": []
    },
    {
      "type": "Project",
      "label": "Totus Mundus",
      "short_label": "Totus Mundus",
      "category": "Research project",
      "description": "This project aims to provide a Web platform for consulting the Kūnyú Wànguó Quántú (坤輿萬國全圖, Complete map of all countries of the world), the data and information related to it. This map, created by the Jesuit Matteo Ricci, has a significant historical value since it is the earliest known Chinese world map in the style of European maps.",
      "technologies": ["Vue.js", "Coffeescript", "D3.js", "OpenSeadragon"],
      "timerange": {
        "start": "November 2016",
        "end": "January 2018"
      },
      "links": [],
      "imgs": ["totusmundus_1.png", "totusmundus_2.png"]
    },
    {
      "type": "Project",
      "label": "Linked Data DoGi",
      "short_label": "Linked Data DoGi",
      "category": "Inter-departmental project",
      "description": "DoGi is a service providing bibliographic references of articles published on Italian juridical journals. The Linked Data DoGi project aims to translate the original relational data of DoGi into Linked data using Semantic Web Technologies. Moreover, Information Visualization techniques have been used in order to present the dataset.",
      "technologies": ["D2RQ", "SPARQL", "D3.js"],
      "timerange": {
        "start": "November 2015",
        "end": "February 2017"
      },
      "links": [
        "http://www.dogi.cnr.it",
        "http://www.ittig.cnr.it/dogi/"
      ]
    },
    {
      "type": "Project",
      "label": "Clavius on the Web",
      "short_label": "Clavius on the Web",
      "category": "Research project",
      "description": "It is a Digital Humanities project aimed to preserve and study the correspondence of Christophorus Clavius, an important mathematician and astronomer who was in contact with some important personalities of his time such as Galileo Galilei. Beside a Web platform for presenting the digital resources and the data created in the project, a tool for annotating manuscripts, based on a lightweight language, has been devised.",
      "technologies": ["Vue.js", "Coffeescript", "D3.js", "PEG.js", "CodeMirror", "OpenSeadragon"],
      "timerange": {
        "start": "September 2015",
        "end": "January 2018"
      },
      "links": []
    },
    {
      "type": "Project",
      "label": "Campusmap",
      "short_label": "Campusmap",
      "category": "National project",
      "description": "This project has the purpose of providing an interactive map for exploring and navigating the Research Campus of the CNR in Pisa, enabling users to get general information about the area, find places and get directions to reach them.",
      "technologies": ["Vue.js", "Coffeescript", "D3.js", "Three.js"],
      "timerange": {
        "start": "March 2015",
        "end": "January 2018"
      },
      "imgs": ["smartarea.png"]
    },
    {
      "type": "Project",
      "label": "ASIA",
      "short_label": "ASIA",
      "category": "Research project",
      "description": "It is a regional project, financed by ANCI Toscana, that aimed to find clues about possible tax-evasion by retrieving and combining information from the Web.",
      "technologies": ["PHP", "D3.js", "Google Custom Search API"],
      "timerange": {
        "start": "August 2013",
        "end": "February 2015"
      },
      "links": []
    },
    {
      "type": "Publication",
      "label": "Text Encoder and Annotator: an all-in-one editor for transcribing and annotating manuscripts with RDF (Extended Version)",
      "short_label": "TEA",
      "authors": ["Fabio Valsecchi", "Matteo Abrate", "Clara Bacciu", "Silvia Piccini", "Andrea Marchetti"],
      "abstract": "In the context of the digitization of manuscripts, transcription and annotation are often distinct, sequential steps. This could lead to difficulties in improving the transcribed text when annotations have already been defined. In order to avoid this, we devised an approach which merges the two steps into the same process. Text Encoder and Annotator (TEA) is a prototype application embracing this concept. TEA is based on a lightweight language syntax which annotates text using Semantic Web technologies. Our approach is currently being developed within the Clavius on the Web project, devoted to studying the manuscripts of Christophorus Clavius, an influential 16th century mathematician and astronomer.",
      "conference": "European Semantic Web Conference",
      "location": "Crete, Greece",
      "date": "June 2016",
      "presentation": "SW4SH2016.pdf",
      "paper": "paper_SW4SH2016.pdf"
    },
    {
      "type": "Publication",
      "label": "Linked Data Maps: Providing a Visual Entry Point for the Exploration of Datasets",
      "short_label": "Linked Data Maps",
      "authors": ["Fabio Valsecchi", "Matteo Abrate", "Clara Bacciu", "Maurizio Tesconi", "Andrea Marchetti"],
      "abstract": "Linked Data sets are an ever-growing, invaluable source of information and knowledge. However, the wide adoption of this large amount of interlinked structured data is still held back by some non trivial obstacles. The one we tackle in this article is the difficulty users have in getting started with their work on Linked Data sources. In fact, querying, and in general dealing with such datasets, requires a deep knowledge about their specific classes, instances and properties. We believe that an entry point that eases the access to such information would significantly reduce the barriers around this technology and foster its promotion. Linked Data Maps is a method for representing RDF graphs as interactive, map-like visualizations, based on our previous work focused on the visual exploration of DBpedia. The approach is extended to deal with a wider range of Linked Data sets, and tested with a user evaluation study on two distinct RDF graphs.",
      "conference": "International Semantic Web Conference",
      "location": "Bethlehem, Pennsylvania, USA",
      "date": "October 2015",
      "presentation": "IESD2015.pdf",
      "paper": "paper_IESD2015.pdf"
    },
    {
      "type": "Publication",
      "label": "DBpedia Atlas: Mapping the Uncharted Lands of Linked Data",
      "short_label": "DBpedia Atlas",
      "authors": ["Fabio Valsecchi", "Matteo Abrate", "Clara Bacciu", "Maurizio Tesconi", "Andrea Marchetti"],
      "abstract": "The available Linked Open Data sources have extremely increased in the last few years. However, finding an effective and efficient way for exploring them still remains an open research issue, due to their complexity and volume. We propose a solution that tries to solve the problem using a visual and interactive exploration tool based on cartographic and information visualisation techniques. In particular, we present an ongoing design study for creating a map of DBpedia.",
      "conference": "International World Wide Web Conference",
      "location": "Florence, Italy",
      "date": "May 2015",
      "presentation": "LDOW2015.pdf",
      "paper": "paper_LDOW2015.pdf"
    },
    {
      "type": "Publication",
      "label": "ASIA - An Investigation Platform for Exploiting Open Source Information in the Fight against Tax Evasion",
      "short_label": "ASIA",
      "authors": ["Clara Bacciu", "Fabio Valsecchi", "Matteo Abrate", "Maurizio Tesconi", "Andrea Marchetti"],
      "abstract": "Tax evasion is a widespread phenomenon confirmed by numerous European and American reports. To contrast it, governments already adopt software solutions that support tax inspectors in their investigations. However, the currently existing systems do not normally take advantage of the constant stream of data published on the Web. Instead, the ASIA project aims to prove the effectiveness of combining this kind of open source information with official data contained in Public Administration archives to fight tax evasion. Our prototype platform deals with two cases of investigation, people and businesses. Public officers have been involved throughout the project, and took part in a preliminary test phase which showed very promising results.",
      "conference": "International Conference on Web Information System and Technologies",
      "location": "Lisbon, Portugal",
      "date": "May 2015",
      "paper": "paper_WEBIST2015.pdf"
    },
    {
      "type": "Publication",
      "label": "Spacetime: a Two Dimensions Search and Visualisation Engine Based on Linked Data",
      "short_label": "Spacetime",
      "authors": ["Fabio Valsecchi", "Marco Ronchetti"],
      "abstract": "DBpedia is one of the most interesting projects in the arena of the Semantic technologies. However, being able to extract useful information from it is not a trivial task for a user without a specific competence. We present the Spacetime, a two dimensions search engine that provides a simple visualization user interface for making it easy for a generic user to perform certain types of queries on the DBpedia body, and having results shown in a graphic and animated form. Spacetime has been equipped with various features, such as heat maps, time sliding animations, map aggregations, icon map customization and map saving and loading.",
      "conference": "International Conference on Advances in Semantic Processing",
      "location": "Rome, Italy",
      "date": "August 2014",
      "paper": "paper_semapro2014.pdf"
    },
    {
      "type": "gist",
      "label": "DBpedia ontology evolution",
      "link": "http://bl.ocks.org/fabiovalse/raw/0dfe7280086553c4a233",
      "code": "http://bl.ocks.org/fabiovalse/0dfe7280086553c4a233",
      "img": "dbpedia_ontology_evolution.png"
    },
    {
      "type": "gist",
      "label": "Interactive version of Dante's Divina Commedia",
      "link": "https://fabiovalse.github.io/Divina-Commedia-Visualization/vis/",
      "code": "https://github.com/fabiovalse/Divina-Commedia-Visualization",
      "img": "divine_comedy.png"
    },
    {
      "type": "gist",
      "label": "Gosper Islands generator (refresh to generate a new island)",
      "link": "http://bl.ocks.org/fabiovalse/raw/7ac2e686d28c4c098232",
      "code": "http://bl.ocks.org/fabiovalse/7ac2e686d28c4c098232",
      "img": "gosper_island.png"
    },
    {
      "type": "gist",
      "label": "Zoomable Hilbert map generator (refresh to generate a new map)",
      "link": "http://bl.ocks.org/fabiovalse/raw/c25191e52406903b4cd9aede7d51ab5e",
      "code": "http://bl.ocks.org/fabiovalse/c25191e52406903b4cd9aede7d51ab5e",
      "img": "hilbert_map.png"
    },
    {
      "type": "gist",
      "label": "Zoomable italian SVG political map",
      "link": "https://bl.ocks.org/fabiovalse/raw/546e3a5080dc6d6f86b08d5635929d1c",
      "code": "https://bl.ocks.org/fabiovalse/546e3a5080dc6d6f86b08d5635929d1c",
      "img": "political_map.png"
    },
    {
      "type": "gist",
      "label": "Zoomable DBpedia instance similarity analysis",
      "link": "http://bl.ocks.org/fabiovalse/raw/cc44f1a671e3ce135775",
      "code": "http://bl.ocks.org/fabiovalse/cc44f1a671e3ce135775",
      "img": "instance_similarity.png"
    },
    {
      "type": "gist",
      "label": "Dijkstra running on a node-link diagram",
      "link": "https://bl.ocks.org/fabiovalse/raw/03d07b071257987add9a7ba28a4befb5",
      "code": "https://bl.ocks.org/fabiovalse/03d07b071257987add9a7ba28a4befb5",
      "img": "dijkstra.png"
    },
    {
      "type": "gist",
      "label": "Solar system representation",
      "link": "https://bl.ocks.org/fabiovalse/raw/96f1c7575f6a66facc34a7d8408287f0/",
      "code": "https://bl.ocks.org/fabiovalse/96f1c7575f6a66facc34a7d8408287f0/",
      "img": "solar_system.png"
    },
    {
      "type": "gist",
      "label": "Chinese radical table",
      "link": "https://bl.ocks.org/fabiovalse/raw/8caa4886c800fe56ec3aeaad289b5998",
      "code": "https://bl.ocks.org/fabiovalse/8caa4886c800fe56ec3aeaad289b5998",
      "img": "chinese_radicals.png"
    }
  ]
}
