{
  "bio": "I'm a temporary research fellow at the Institute of Informatics and Telematics (IIT) of the National Research Council (CNR). In particular, I work in a group called Web Applications for the Future Internet (WAFI). I received my Ph.D. in Information Engineering at the University of Pisa by presenting a thesis about the visualization of Semantic Web data. My interests are mainly focused on data analysis, visualization and Web technologies while my research activities currently cover Information Visualization and Semantic Web.",
  "nodes": [
    {
      "type": "Education",
      "label": "Ph.D. in Information Engineering",
      "short_label": "Ph.D.",
      "location": "University of Pisa",
      "description": "My thesis, Interactive Visualization of Semantic Web Data, presents a method based on cartographic principles for visually representing and exploring Linked Data sets as they were traditional geographic maps.",
      "timerange": {
        "start": "October 2013",
        "end": "January 2017"
      },
      "imgs": ["dbpedia.png", "linkedmdb.png"]
    },
    {
      "type": "Education",
      "label": "Master Degree in Computer Science",
      "short_label": "Master Degree",
      "location": "University of Trento",
      "description": "I presented a thesis that proposes a tool for searching specific data coming from DBpedia and visualizing it in a spatio-temporal way.",
      "timerange": {
        "start": "October 2011",
        "end": "July 2013"
      }
    },
    {
      "type": "Education",
      "label": "Bachelor Degree in Computer Science",
      "short_label": "Bachelor Degree",
      "location": "University of Milano Bicocca",
      "description": "I worked on a thesis focused on pedestrian dynamics, a research area studying the pedestrian behaviours. The thesis describes a use case developed at the Salone del Mobile in Milan, a model and the simulations performed on it.",
      "timerange": {
        "start": "October 2008",
        "end": "July 2011"
      }
    },
    {
      "type": "Experience",
      "label": "Research fellow",
      "short_label": "Research fellow",
      "location": "National Research Council (CNR), Institute of Informatics and Telematics (IIT)",
      "place": "Pisa",
      "description": "The activities I have carried out in the last years at the CNR were primarily focused on the design and development of web applications. I partecipated in different projects were data always had a key role. For this reason I developed skills in the management, analysis and visualization of data using different kind of web technologies.",
      "timerange": {
        "start": "August 2013",
        "end": "Present"
      }
    },
    {
      "type": "Experience",
      "label": "Intern",
      "short_label": "Intern",
      "location": "Complex Systems and Artificial Intelligence (CSAI) Research Center",
      "place": "Milano",
      "description": "I performed this internship at the end of my Bachelor Degree. I worked at the CSAI center and I partecipated to their activities focused on pedestrian dynamics, the topic of the thesis developed during the intership.",
      "timerange": {
        "start": "March 2011",
        "end": "June 2011"
      }
    },
    {
      "type": "Experience",
      "label": "Freelance developer",
      "short_label": "Freelance developer",
      "description": "I developed a web application for managing the administration activities of a social cooperative (Atipica Cooperativa Sociale onlus).",
      "timerange": {
        "start": "May 2007",
        "end": "March 2008"
      }
    },
    {
      "type": "Experience",
      "label": "Intern",
      "short_label": "Intern",
      "location": "Redix Information SRL",
      "description": "I partecipated in the development of a project management software for the Milan Chamber of Commerce.",
      "place": "Lissone (MI)",
      "timerange": {
        "start": "June 2006",
        "end": "July 2006"
      }
    },
    {
      "type": "Project",
      "label": "Visolario",
      "short_label": "Visolario",
      "category": "Research project",
      "description": "",
      "technologies": ["Coffeescript", "D3.js", "Power graph analysis"],
      "timerange": {
        "start": "January 2017",
        "end": "Present"
      },
      "links": []
    },
    {
      "type": "Project",
      "label": "Totus Mundus",
      "short_label": "Totus Mundus",
      "category": "Research project",
      "description": "This project aims to provide a web platform for exploring and consulting the Kūnyú Wànguó Quántú (坤輿萬國全圖, Complete map of all countries of the world) of Matteo Ricci, the earliest known Chinese world map with the style of European maps.",
      "technologies": ["Vue.js", "Coffeescript", "D3.js", "OpenSeadragon"],
      "timerange": {
        "start": "November 2016",
        "end": "Present"
      },
      "links": [],
      "imgs": ["totusmundus_1.png", "totusmundus_2.png"]
    },
    {
      "type": "Project",
      "label": "Linked Data DoGi",
      "short_label": "Linked Data DoGi",
      "category": "Inter-departmental project",
      "description": "DoGi is a database containing bibliographic references of articles published on italian juridical journals. The DoGi project consists in the translation of this relational database with Semantic Web Technologies. Moreover, Information Visualization techniques have been used in order to present the dataset.",
      "technologies": ["D2RQ", "SPARQL", "D3.js"],
      "timerange": {
        "start": "November 2015",
        "end": "February 2017"
      },
      "links": [
        "http://www.dogi.cnr.it",
        "http://www.ittig.cnr.it/dogi/"
      ]
    },
    {
      "type": "Project",
      "label": "Clavius on the web",
      "short_label": "Clavius on the web",
      "category": "Research project",
      "description": "This digital humanities project aimed to preserve and study the correspondence of Christophorus Clavius, a set of letters written to him by some well-known personalities of its time such as Galileo Galilei. Among the activities of the project, I partecipated in the design and development of a tool for annotating manuscripts based on a lightweight domain specific language.",
      "technologies": ["Vue.js", "Coffeescript", "D3.js", "PEG.js", "CodeMirror", "OpenSeadragon"],
      "timerange": {
        "start": "September 2015",
        "end": "Present"
      },
      "links": []
    },
    {
      "type": "Project",
      "label": "Campusmap",
      "short_label": "Campusmap",
      "category": "National project",
      "description": "This project has the aim of providing an interactive map for the exploration of the Research Campus of the CNR of Pisa in order to enable users to get general information about the area, find places and get directions to reach them.",
      "technologies": ["Vue.js", "Coffeescript", "D3.js", "Three.js"],
      "timerange": {
        "start": "March 2015",
        "end": "Present"
      },
      "imgs": ["smartarea.png"]
    },
    {
      "type": "Project",
      "label": "ASIA",
      "short_label": "ASIA",
      "category": "Research project",
      "description": "This project conducted with the collaboration of ANCI Toscana, aimed to retrieve information from the Web and enrich people profiles in order to find clues about their possible tax-evasion activities.",
      "technologies": ["PHP", "D3.js", "Google Custom Search API"],
      "timerange": {
        "start": "August 2013",
        "end": "February 2015"
      },
      "links": []
    },
    {
      "type": "Publication",
      "label": "Text Encoder and Annotator: an all-in-one editor for transcribing and annotating manuscripts with RDF (Extended Version)",
      "short_label": "TEA",
      "authors": ["Fabio Valsecchi", "Matteo Abrate", "Clara Bacciu", "Silvia Piccini", "Andrea Marchetti"],
      "abstract": "In the context of the digitization of manuscripts, transcription and annotation are often distinct, sequential steps. This could lead to difficulties in improving the transcribed text when annotations have already been defined. In order to avoid this, we devised an approach which merges the two steps into the same process. Text Encoder and Annotator (TEA) is a prototype application embracing this concept. TEA is based on a lightweight language syntax which annotates text using Semantic Web technologies. Our approach is currently being developed within the Clavius on the Web project, devoted to studying the manuscripts of Christophorus Clavius, an influential 16th century mathematician and astronomer.",
      "conference": "European Semantic Web Conference",
      "location": "Crete, Greece",
      "date": "June 2016",
      "presentation": "SW4SH2016.pdf",
      "paper": "paper_SW4SH2016.pdf"
    },
    {
      "type": "Publication",
      "label": "Linked Data Maps: Providing a Visual Entry Point for the Exploration of Datasets",
      "short_label": "Linked Data Maps",
      "authors": ["Fabio Valsecchi", "Matteo Abrate", "Clara Bacciu", "Maurizio Tesconi", "Andrea Marchetti"],
      "abstract": "Linked Data sets are an ever-growing, invaluable source of information and knowledge. However, the wide adoption of this large amount of interlinked structured data is still held back by some non trivial obstacles. The one we tackle in this article is the difficulty users have in getting started with their work on Linked Data sources. In fact, querying, and in general dealing with such datasets, requires a deep knowledge about their specific classes, instances and properties. We believe that an entry point that eases the access to such information would significantly reduce the barriers around this technology and foster its promotion. Linked Data Maps is a method for representing RDF graphs as interactive, map-like visualizations, based on our previous work focused on the visual exploration of DBpedia. The approach is extended to deal with a wider range of Linked Data sets, and tested with a user evaluation study on two distinct RDF graphs.",
      "conference": "International Semantic Web Conference",
      "location": "Bethlehem, Pennsylvania, USA",
      "date": "October 2015",
      "presentation": "IESD2015.pdf",
      "paper": "paper_IESD2015.pdf"
    },
    {
      "type": "Publication",
      "label": "DBpedia Atlas: Mapping the Uncharted Lands of Linked Data",
      "short_label": "DBpedia Atlas",
      "authors": ["Fabio Valsecchi", "Matteo Abrate", "Clara Bacciu", "Maurizio Tesconi", "Andrea Marchetti"],
      "abstract": "The available Linked Open Data sources have extremely increased in the last few years. However, finding an effective and efficient way for exploring them still remains an open research issue, due to their complexity and volume. We propose a solution that tries to solve the problem using a visual and interactive exploration tool based on cartographic and information visualisation techniques. In particular, we present an ongoing design study for creating a map of DBpedia.",
      "conference": "International World Wide Web Conference",
      "location": "Florence, Italy",
      "date": "May 2015",
      "presentation": "LDOW2015.pdf",
      "paper": "paper_LDOW2015.pdf"
    },
    {
      "type": "Publication",
      "label": "ASIA - An Investigation Platform for Exploiting Open Source Information in the Fight against Tax Evasion",
      "short_label": "ASIA",
      "authors": ["Clara Bacciu", "Fabio Valsecchi", "Matteo Abrate", "Maurizio Tesconi", "Andrea Marchetti"],
      "abstract": "Tax evasion is a widespread phenomenon confirmed by numerous European and American reports. To contrast it, governments already adopt software solutions that support tax inspectors in their investigations. However, the currently existing systems do not normally take advantage of the constant stream of data published on the Web. Instead, the ASIA project aims to prove the effectiveness of combining this kind of open source information with official data contained in Public Administration archives to fight tax evasion. Our prototype platform deals with two cases of investigation, people and businesses. Public officers have been involved throughout the project, and took part in a preliminary test phase which showed very promising results.",
      "conference": "International Conference on Web Information System and Technologies",
      "location": "Lisbon, Portugal",
      "date": "May 2015",
      "paper": "paper_WEBIST2015.pdf"
    },
    {
      "type": "Publication",
      "label": "Spacetime: a Two Dimensions Search and Visualisation Engine Based on Linked Data",
      "short_label": "Spacetime",
      "authors": ["Fabio Valsecchi", "Marco Ronchetti"],
      "abstract": "DBpedia is one of the most interesting projects in the arena of the Semantic technologies. However, being able to extract useful information from it is not a trivial task for a user without a specific competence. We present the Spacetime, a two dimensions search engine that provides a simple visualization user interface for making it easy for a generic user to perform certain types of queries on the DBpedia body, and having results shown in a graphic and animated form. Spacetime has been equipped with various features, such as heat maps, time sliding animations, map aggregations, icon map customization and map saving and loading.",
      "conference": "International Conference on Advances in Semantic Processing",
      "location": "Rome, Italy",
      "date": "August 2014",
      "paper": "paper_semapro2014.pdf"
    }
  ]
}